#### Terragrunt Format and Style 🖌 `success`
#### Terragrunt Initialization ⚙️ `success`
#### Terragrunt Validation 🤖 `success`
#### Terragrunt Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
aws_ecr_repository.ecr: Refreshing state... [id=vegero-tg-ecr]
data.aws_availability_zones.available: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03543ef974bbfb9f5]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::178112661675:policy/vpc-flow-log-to-cloudwatch-20220610122220698800000001]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20220610122220699900000002]
data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20220610122220699900000002-20220610122221508600000003]
Releasing state lock. This may take a few moments...
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bbc58bcb466c7d29]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-03543ef974bbfb9f5]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09240ac87538106b6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0d5416effa64d3665]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d910b9d8b7fe43e3]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0bdad0282effea637]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0215bc3d4b3ca3741]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0537a720f34c41600]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-07818a22104b7c746]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4c9d69da3b05181]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e142cc476be3768a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05b4d4b44bb3e3478]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05910c8d99b812b2b]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0537a720f34c416001080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ecbf447bd331a79]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f4ad60f8faeb24d3]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0ea4252000dcde66b]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-03fe2d80f10c4efce]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
aws_security_group.additional: Refreshing state... [id=sg-0c1cc8c6de085c99c]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Releasing state lock. This may take a few moments...
Acquiring state lock. This may take a few moments...
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["green"].aws_security_group.this[0]: Refreshing state... [id=sg-0b63a542d3b84c905]
aws_kms_key.eks: Refreshing state... [id=8711e009-979c-4736-88f5-e8ab7ac54f18]
module.eks.module.eks_managed_node_group["blue"].aws_security_group.this[0]: Refreshing state... [id=sg-068e200e05b29168c]
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/vegero-eks/cluster]
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0b54fedac92427825]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-084b0e8e29e025a75]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["blue"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["green"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["blue"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["blue"].aws_iam_role.this[0]: Refreshing state... [id=blue-eks-node-group-20220610122316676200000005]
module.eks.module.eks_managed_node_group["green"].aws_iam_role.this[0]: Refreshing state... [id=green-eks-node-group-20220610122316672800000002]
module.eks.module.eks_managed_node_group["green"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]
module.eks.module.eks_managed_node_group["blue"].data.aws_caller_identity.current: Read complete after 0s [id=178112661675]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-3978671016]
module.eks.aws_security_group_rule.node["egress_ntp_tcp"]: Refreshing state... [id=sgrule-4005708586]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2997734747]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3579473098]
module.eks.aws_security_group_rule.node["egress_ntp_udp"]: Refreshing state... [id=sgrule-2421974567]
module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-1990701573]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1712564500]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3259763451]
module.eks.aws_security_group_rule.node["egress_cluster_443"]: Refreshing state... [id=sgrule-801814459]
module.eks.aws_security_group_rule.node["egress_self_coredns_udp"]: Refreshing state... [id=sgrule-3650886108]
module.eks.aws_security_group_rule.node["egress_https"]: Refreshing state... [id=sgrule-823950900]
module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"]: Refreshing state... [id=sgrule-1476107194]
module.eks.aws_security_group_rule.cluster["egress_nodes_443"]: Refreshing state... [id=sgrule-507251822]
module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-3240163]
module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"]: Refreshing state... [id=sgrule-753444272]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1136384929]
module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=blue-eks-node-group-20220610122316676200000005-2022061012231752710000000c]
module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=green-eks-node-group-20220610122316672800000002-20220610122317400900000008]
module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=green-eks-node-group-20220610122316672800000002-20220610122317422500000009]
module.eks.module.eks_managed_node_group["green"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=green-eks-node-group-20220610122316672800000002-20220610122317392100000007]
module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=blue-eks-node-group-20220610122316676200000005-2022061012231750690000000b]
module.eks.module.eks_managed_node_group["blue"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=blue-eks-node-group-20220610122316676200000005-2022061012231742340000000a]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=vegero-eks-cluster-2022061012231759680000000d]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::178112661675:policy/vegero-eks-cluster-ClusterEncryption20220610122326844000000010]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=vegero-eks-cluster-2022061012231759680000000d-20220610122327090500000011]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=vegero-eks-cluster-2022061012231759680000000d-2022061012231839730000000f]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=vegero-eks-cluster-2022061012231759680000000d-2022061012231838760000000e]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=vegero-eks]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-07b164e55f0849dc8,GithubRepo]
module.eks.aws_ec2_tag.cluster_primary_security_group["GithubOrg"]: Refreshing state... [id=sg-07b164e55f0849dc8,GithubOrg]
module.eks.aws_ec2_tag.cluster_primary_security_group["Example"]: Refreshing state... [id=sg-07b164e55f0849dc8,Example]
module.eks.module.eks_managed_node_group["green"].aws_launch_template.this[0]: Refreshing state... [id=lt-03f0d40d53cd4883c]
module.eks.module.eks_managed_node_group["blue"].aws_launch_template.this[0]: Refreshing state... [id=lt-0b407705bca22d343]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=a7fd5916ef0d0e3217b5f69c9d2a7817a4360ea0]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::178112661675:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/8FDC16E8932CBBB345424885B4B5A9E8]
module.eks.module.eks_managed_node_group["blue"].aws_eks_node_group.this[0]: Refreshing state... [id=vegero-eks:blue-20220610123238053100000016]
module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0]: Refreshing state... [id=vegero-eks:green-20220610123238057800000018]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["blue"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:eu-north-1:178112661675:nodegroup/vegero-eks/blue-20220610123238053100000016/26c0a6cd-1584-ac02-133f-fb3b1783b998"
        id                     = "vegero-eks:blue-20220610123238053100000016"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-blue-20220610123238053100000016-26c0a6cd-1584-ac02-133f-fb3b1783b998"
                    },
                ]
              + remote_access_security_group_id = ""
            },
        ]
        tags                   = {
            "Example"    = "vegero-eks"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-eks"
            "Name"       = "blue"
        }
        # (8 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn                    = "arn:aws:eks:eu-north-1:178112661675:nodegroup/vegero-eks/green-20220610123238057800000018/42c0a6cd-158a-aa80-214a-d1f9de5533c1"
        id                     = "vegero-eks:green-20220610123238057800000018"
      + resources              = [
          + {
              + autoscaling_groups              = [
                  + {
                      + name = "eks-green-20220610123238057800000018-42c0a6cd-158a-aa80-214a-d1f9de5533c1"
                    },
                ]
              + remote_access_security_group_id = ""
            },
        ]
        tags                   = {
            "Example"    = "vegero-eks"
            "ExtraTag"   = "example"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-eks"
            "Name"       = "green"
        }
        # (10 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "vegero-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "vegero-eks"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags          = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all      = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "vegero-eks"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags              = {
          + "Example"    = "vegero-eks"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-eks"
        }
      + tags_all          = {
          + "DeployedBy"       = "Terraform"
          + "DeploymentPrefix" = "vegero-eks"
          + "Environment"      = "Development"
          + "Example"          = "vegero-eks"
          + "GithubOrg"        = "terraform-aws-modules"
          + "GithubRepo"       = "terraform-aws-eks"
          + "OwnerEmail"       = "devops@example.com"
          + "Team"             = "DevOps"
          + "TerminationDate"  = "Permanent"
        }
    }

  # module.eks.module.eks_managed_node_group["blue"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:eu-north-1:178112661675:nodegroup/vegero-eks/blue-20220610123238053100000016/26c0a6cd-1584-ac02-133f-fb3b1783b998" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "vegero-eks:blue-20220610123238053100000016" -> (known after apply)
      - labels                 = {} -> null
      ~ node_group_name        = "blue-20220610123238053100000016" -> (known after apply)
      ~ release_version        = "1.22.6-20220526" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-blue-20220610123238053100000016-26c0a6cd-1584-ac02-133f-fb3b1783b998"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Example"    = "vegero-eks"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-eks"
            "Name"       = "blue"
        }
        # (8 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-0b407705bca22d343" -> (known after apply)
            name    = "blue-20220610123237108500000014"
            # (1 unchanged attribute hidden)
        }



      ~ update_config {
          ~ max_unavailable            = 1 -> (known after apply)
          ~ max_unavailable_percentage = 0 -> (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

  # module.eks.module.eks_managed_node_group["green"].aws_eks_node_group.this[0] is tainted, so must be replaced
+/- resource "aws_eks_node_group" "this" {
      ~ arn                    = "arn:aws:eks:eu-north-1:178112661675:nodegroup/vegero-eks/green-20220610123238057800000018/42c0a6cd-158a-aa80-214a-d1f9de5533c1" -> (known after apply)
      ~ disk_size              = 0 -> (known after apply)
      ~ id                     = "vegero-eks:green-20220610123238057800000018" -> (known after apply)
      ~ node_group_name        = "green-20220610123238057800000018" -> (known after apply)
      ~ release_version        = "1.22.6-20220526" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-green-20220610123238057800000018-42c0a6cd-158a-aa80-214a-d1f9de5533c1"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Example"    = "vegero-eks"
            "ExtraTag"   = "example"
            "GithubOrg"  = "terraform-aws-modules"
            "GithubRepo" = "terraform-aws-eks"
            "Name"       = "green"
        }
        # (10 unchanged attributes hidden)

      ~ launch_template {
          ~ id      = "lt-03f0d40d53cd4883c" -> (known after apply)
            name    = "green-20220610123237106600000012"
            # (1 unchanged attribute hidden)
        }


      - taint {
          - effect = "NO_SCHEDULE" -> null
          - key    = "dedicated" -> null
          - value  = "gpuGroup" -> null
        }


      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/eks/main.tf line 305, in resource "aws_eks_addon" "this":
 305: resource "aws_eks_addon" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute modified_at is decided by the provider alone and therefore
there can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

Results for commit: ecdff734249a44631c36a8c56fbae87d1720d93b

*Pusher: @vvvegero97, Action: `pull_request`, Working Directory: `terragrunt_way`, Workflow: `Terragrunt CI/CD Pipeline`*